In [28]:
import pandas as pd
import numpy as np

dataframe= pd.DataFrame(
{"name" : ['John', 'Jade', 'Joe', 'Jair'],
"age" : [17,np.NaN, 23, 15],
"sex" : ['male', 'Female', 'male', np.NaN],
"score" : [93, 88, 87, 65],

})

## Select

### Select all columns

In [29]:
dataframe

   name   age     sex  score
0  John  17.0    male     93
1  Jade   NaN  Female     88
2   Joe  23.0    male     87
3  Jair  15.0     NaN     65

### Select specific columns

In [30]:
dataframe[['name','age']]

   name   age
0  John  17.0
1  Jade   NaN
2   Joe  23.0
3  Jair  15.0

### Select with functions

In [31]:
dataframe['age'].mean()

18.333333333333332

### Assign new column

In [32]:
dataframe['score_age'] = dataframe['score'] / dataframe['age']
dataframe

   name   age     sex  score  score_age
0  John  17.0    male     93   5.470588
1  Jade   NaN  Female     88        NaN
2   Joe  23.0    male     87   3.782609
3  Jair  15.0     NaN     65   4.333333

## Where

In [36]:
dataframe[(dataframe['age'] >= 17)]

   name   age   sex  score  score_age
0  John  17.0  male     93   5.470588
2   Joe  23.0  male     87   3.782609

### Where using OR and AND

#### Where using OR

In [33]:
dataframe[(dataframe['age'] >= 20) | (dataframe['score'] > 80)]

   name   age     sex  score  score_age
0  John  17.0    male     93   5.470588
1  Jade   NaN  Female     88        NaN
2   Joe  23.0    male     87   3.782609

#### Where using AND

In [26]:
dataframe[(dataframe['age'] >= 20) & (dataframe['score'] > 80)]

  name   age   sex  score        d  score_age
2  Joe  23.0  male     87  maleJoe   3.782609

### Where with NULL checking

#### Where with IS NOT NULL

In [35]:
dataframe[dataframe['age'].notna()]

   name   age   sex  score  score_age
0  John  17.0  male     93   5.470588
2   Joe  23.0  male     87   3.782609
3  Jair  15.0   NaN     65   4.333333

#### Where with IS NULL

In [34]:
dataframe[dataframe['sex'].isna()]

   name   age  sex  score  score_age
3  Jair  15.0  NaN     65   4.333333

## Group by

### Group by on a single column

In [38]:
dataframe.groupby('score').size()

score
65    1
87    1
88    1
93    1
dtype: int64

### Group by on multiple columns

In [45]:
dataframe.groupby(["age", "score"]).agg({"age": [np.size, np.size]})

            age
           size size
age  score
15.0 65       1    1
17.0 93       1    1
23.0 87       1    1

## Order by

### Order by

In [48]:
dataframe.sort_values(by=['age'])

   name   age     sex  score  score_age
3  Jair  15.0     NaN     65   4.333333
0  John  17.0    male     93   5.470588
2   Joe  23.0    male     87   3.782609
1  Jade   NaN  Female     88        NaN

### Order by (Descending)

In [50]:
dataframe.sort_values(by=['age'], ascending=False)

   name   age     sex  score  score_age
2   Joe  23.0    male     87   3.782609
0  John  17.0    male     93   5.470588
3  Jair  15.0     NaN     65   4.333333
1  Jade   NaN  Female     88        NaN

## Limit

In [51]:
dataframe.head(2)

   name   age     sex  score  score_age
0  John  17.0    male     93   5.470588
1  Jade   NaN  Female     88        NaN